app/controllers/homepage_controller.rb

 def show
   if session[:current_id]
      puts "User ID: "
      puts session[:current_id]
      @user = User.find(session[:current_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]