app/controllers/registrations_controller.rb

	def create
	    #complete this method
            puts "creating user..."
            puts user_params
            @user = User.create(user_params)
---
INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)