app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    #complete this method
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "name" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Rodrigo"], ["password", "gamerlala123"], ["updated_at", "2019-04-17 14:06:37.408679"], ["id", 5]]

  def destroy
    #complete this method
    @user.delete
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]